t = {1:'08:10', 2:'09:55', 3:'11:40', 4:'13:35', 5:'15:20', 6:'17:05', 7:'18:50', 8:'20:25'}
d = {1:'Пн', 2:'Вт', 3:'Ср', 4:'Чт', 5:'Пт', 6:'Сб', 7:'Вс'}
w = {1:'Числ.', 2:'Знам.'}

r = {1:'203a', 2:'203', 3:'120-k2', 4:'114-k2', 5:'116-k2', 6:'112-k2'}

p = {
    0: 'Рисунок',
    1: 'Живопись',
    2: 'Основы композиции',
    3: 'Мировая художественная культура',
    4: 'Трехмерное моделирование',
    5: 'Дизайн и анимация персонажей'
}

prep = {
    0:'проф. Ганеев Р.М.',
    1:'проф. Царев Н.Н.',
    2:'доц. Бауков В.А.',
    3:'доц. Корсаков В.В.',
    4:'ст. преп. Фролов А.В.'
}

grp = {0:'9833', 1:'8833', 2:'7833', 3:'603В', 4:'503В'}

kind = {0: 'ЛЕК.', 1:'УПР.', 2:'ЛАБ.'}

# преподаватель
# дисциплина
# группа
# вид занятий
# аудитория
load = [
    (0, 0, 4, 1, 0, 1)
]

shedule = {}
for e1 in t:
    for e2 in d:
        for e3 in w:
            shedule[tuple([e1, e2, e3])] = None

for item in load:
    print(item[0], prep[item[1]], p[item[2]], grp[item[3]], kind[item[4]], r[item[5]])

print(shedule)